dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f302_pinmux.h
# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr == 15) && (channel_nr == -1)) ?  9 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr == 15) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr == 15) && (channel_nr ==  2)) ?  9 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA07) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  6 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  6 : \
	((gpio == PA09) && (timer_nr ==  2) && (channel_nr ==  3)) ? 10 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  6 : \
	((gpio == PA10) && (timer_nr ==  2) && (channel_nr ==  4)) ? 10 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ? 11 : \
	((gpio == PA12) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA12) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PA13) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  6 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB05) && (timer_nr == 17) && (channel_nr ==  1)) ? 10 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PB07) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB09) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PB14) && (timer_nr == 15) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PB15) && (timer_nr == 15) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB15) && (timer_nr == 15) && (channel_nr == -1)) ?  2 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  4 : \
	((gpio == PC00) && (timer_nr ==  1) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC01) && (timer_nr ==  1) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC02) && (timer_nr ==  1) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC03) && (timer_nr ==  1) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC13) && (timer_nr ==  1) && (channel_nr == -1)) ?  4 : \
	((gpio == PF00) && (timer_nr ==  1) && (channel_nr == -3)) ?  6 : \
	AF_NO_SUCH_PINFUNC)
#endif
